update readme file with latest changes
